<a href="https://colab.research.google.com/github/Akashkumarashu/data-science-project/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
con1 = sqlite3.connect('example2.db')
cur1 = con1.cursor()

In [ ]:

cur1.execute('''CREATE TABLE student1(sid integer,sname text,course text,admissionfees float)''')

In [ ]:
resultset=cur1.execute("select * from student1")
for row in resultset:
  print(row)

In [ ]:
for row in resultset:
  print(row)

In [ ]:
cur1.execute('''INSERT INTO student1  VALUES (110043,"jay","btech",450000)''')

In [ ]:
cur1.execute('''INSERT INTO student1  VALUES (110044,"rohan","bba",200000)''')

In [ ]:
cur1.execute('''INSERT INTO student1  VALUES (110045,"ankit","ba",190000)''')

In [ ]:
cur1.execute('''INSERT INTO student1  VALUES (110046,"rahul","bcom",290000)''')

In [ ]:
for row in resultset:
  print(row)

In [ ]:
cur1.execute("DELETE FROM student1 WHERE sid=110044");

In [ ]:
cur1.execute('''DELETE FROM student1 WHERE sname=("ankit")''');

In [ ]:
cur1.execute("UPDATE student1 SET course= 'mba' WHERE sid = 110043")

In [ ]:
cur1.execute('''INSERT INTO student1  VALUES (110048,"bobby","bca",390000)''')

In [ ]:
resultset=cur1.execute("select * from student1")
for row in resultset:
  print(row)

(110043, 'jay', 'mba', 450000.0)
(110046, 'rahul', 'bcom', 290000.0)
(110048, 'bobby', 'bca', 390000.0)

In [ ]:
resultset2=cur1.execute("select * from student1 order by sname asc")
for row in resultset:
  print(row)

(110048, 'bobby', 'bca', 390000.0)
(110043, 'jay', 'mba', 450000.0)
(110046, 'rahul', 'bcom', 290000.0)

In [ ]:
row1=cur1.execute('''SELECT * FROM student1 WHERE course = 'mba' AND admissionfees>390000''')

In [ ]:
for row in row1:
  print(row[0],row[1])

110043 jay

In [ ]:
row1=cur1.execute('''SELECT * FROM student1''')

In [ ]:
row1=cur1.execute('''SELECT * FROM student1 where course like "b%" ''')

In [ ]:
for row in row1:
  print(row)

(110046, 'rahul', 'bcom', 290000.0)
(110048, 'bobby', 'bca', 390000.0)

In [ ]:
cur1.execute("SELECT * FROM student1 LIMIT 2")

myresult = cur1.fetchall()

for x in myresult:
  print(x)

(110043, 'jay', 'mba', 450000.0)
(110046, 'rahul', 'bcom', 290000.0)

In [ ]:
cur1.execute('''create table city( cityname text, temp int) ''')

In [ ]:
cur1.execute('''insert into city values("mumbai", 34)''')

In [ ]:
cur1.execute('''insert into city values("delhi", 24)''')

In [ ]:

cur1.execute('''insert into city values("chennai", 37)''')

In [ ]:
cur1.execute('''insert into city values("kolkata", 34)''')

In [ ]:
row1=cur1.execute('''SELECT * FROM city ''')

In [ ]:
for row in row1:
  print(row)

('mumbai', 34)
('delhi', 24)
('chennai', 37)
('kolkata', 34)

In [ ]:
cur1.execute('''delete from city where temp=24''' )

In [ ]:
cur1.execute('''create table anothercity( cname text, humidity int)''')

In [ ]:
cur1.execute('''insert into anothercity values("delhi", 40)''')

In [ ]:
rows=cur1.execute('''select * from anothercity''')
for row in rows:
  print(row)

('delhi', 40)

In [ ]:
resultset=cur1.execute('''SELECT city.cityname as "cityname", city.temp as "temp", anothercity.humidity as "humidity"
FROM city
INNER JOIN anothercity ON city.cityname = anothercity.cname''');

In [ ]:
for row in resultset:
  print(row)

In [ ]:
cur1.execute('''drop table city''')

In [ ]:
cur1.execute('''select * from city''')

OperationalError: ignored